/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³FatLF     ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Faturamento de vendas livro fiscal                          º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ crf010                                                     º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function FatLF(nMes)

Local cALiasSF3 := "cALiasSF3"
Local nSF3		:= 0
Local aStruSF3  := SF3->(dbStruct())
Local cQuery 	:= ""	
Local aArea		:= GetArea()
Local nValor	:= 0 

cQuery := "SELECT SUM(F3_VALCONT) AS VALOR FROM "
cQuery += RetSqlName('SF3')
cQuery += " WHERE SUBSTRING(F3_ENTRADA,1,6) = '" + Iif((nMes-2 == -1 .and. nMes == 1) .or. (nMes-2 == 0 .and. nMes == 2) ,StrZero(Year(MV_PAR02)-1,4),SUBSTR(DTOS(MV_PAR02),1,4)) + StrZero(nMes,2) + "' "
cQuery += " AND F3_FILIAL = '"+xFilial("SF3")+"' "
cQuery += " AND F3_CFO IN (" + Alltrim(cCFOPVenda) + ") "
cQuery += " AND F3_OBSERV <> 'NF CANCELADA' "
cQuery += " AND D_E_L_E_T_ <> '*' "
	
cQuery:=ChangeQuery(cQuery)

MsAguarde({|| dbUseArea(.T.,"TOPCONN",TcGenQry(,,cQuery),cAliasSF3,.T.,.T.)},"Aguarde...","Faturamento de Vendas no Livro Fiscal...")
	
For nSF3 := 1 To len(aStruSF3)
	If aStruSF3[nSF3][2] <> "C" .And. FieldPos(aStruSF3[nSF3][1])<>0
		TcSetField(cAliasSF3,aStruSF3[nSF3][1],aStruSF3[nSF3][2],aStruSF3[nSF3][3],aStruSF3[nSF3][4])
	EndIf
Next nSF3

DbSelectArea(cAliasSF3)

Do While (cAliasSF3)->(!EOF())
	nValor+= (cAliasSF3)->VALOR
	(cAliasSF3)->(DbSkip())
EndDo
	
DbSelectArea(cAliasSF3)
dbCloseArea()

RestArea(aArea)

Return(nValor)

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³FatLF     ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Faturamento de vendas livro fiscal                          º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ crf010                                                     º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function FatLFDIF(aFatLFDIF,nMes)
Local cALiasSF3 := "cALiasSF3"
Local nSF3		:= 0
Local aStruSF3  := SF3->(dbStruct())
Local cQuery 	:= ""	
Local aArea		:= GetArea()

cQuery := " SELECT F3_NFISCAL,F3_SERIE,F3_EMISSAO,F3_VALCONT,F3_OBSERV FROM "
cQuery += RetSqlName('SF3')
cQuery += " WHERE D_E_L_E_T_ <> '*' AND "
cQuery += " F3_FILIAL = '"+xFilial("SF3")+"' "
cQuery += " AND SUBSTRING(F3_ENTRADA,1,6) = '" + Iif((nMes-2 == -1 .and. nMes == 1) .or. (nMes-2 == 0 .and. nMes == 2) ,StrZero(Year(MV_PAR02)-1,4),SUBSTR(DTOS(MV_PAR02),1,4))+ StrZero(nMes,2) + "' "
cQuery += " AND F3_CFO IN (" + Alltrim(cCFOPVenda) + ") "
cQuery += " AND D_E_L_E_T_ <> '*' "
cQuery += " AND F3_NFISCAL+F3_SERIE NOT IN (SELECT D2_DOC+D2_SERIE FROM "
cQuery += RetSqlName('SD2')
cQuery += " WHERE D_E_L_E_T_ <> '*' "
cQuery += " AND D2_CF IN (" + Alltrim(cCFOPVenda) + ") "
cQuery += " AND D2_LOCAL IN ('03','04') "
cQuery += " AND SUBSTRING(D2_EMISSAO,1,6) = '" + Iif((nMes-2 == -1 .and. nMes == 1) .or. (nMes-2 == 0 .and. nMes == 2) ,StrZero(Year(MV_PAR02)-1,4),SUBSTR(DTOS(MV_PAR02),1,4)) + StrZero(nMes,2) + "' "
cQuery += " AND D2_FILIAL = '"+xFilial("SD2")+"' )"
	
cQuery:=ChangeQuery(cQuery)
	
MsAguarde({|| dbUseArea(.T.,"TOPCONN",TcGenQry(,,cQuery),cAliasSF3,.T.,.T.)},"Aguarde...","Processando Diferenca Fiscal (NF´s que constam apenas no Livro Fiscal)...")

For nSF3 := 1 To len(aStruSF3)
	If aStruSF3[nSF3][2] <> "C" .And. FieldPos(aStruSF3[nSF3][1])<>0
		TcSetField(cAliasSF3,aStruSF3[nSF3][1],aStruSF3[nSF3][2],aStruSF3[nSF3][3],aStruSF3[nSF3][4])
	EndIf
Next nSF3
	
DbSelectArea(cAliasSF3)
If (cAliasSF3)->(!EOF()) 	                                                    
	Do While (cAliasSF3)->(!EOF()) 
		aadd(aFatLFDIF,{(cAliasSF3)->F3_NFISCAL,(cAliasSF3)->F3_SERIE,(cAliasSF3)->F3_OBSERV,(cAliasSF3)->F3_VALCONT})
		(cAliasSF3)->(DbSkip())
	EndDo
EndIf	
DbSelectArea(cAliasSF3)
dbCloseArea()

RestArea(aArea)

Return(.T.)

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³FatLF     ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Faturamento de vendas livro fiscal                          º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ crf010                                                     º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function FatFTDIF(aFatFTDIF,nMes)
Local cALiasSD2 := "cALiasSD2"
Local nSD2		:= 0
Local aStruSD2  := SD2->(dbStruct())
Local nSF2		:= 0
Local aStruSF2  := SF2->(dbStruct())
Local cQuery 	:= ""	
Local aArea		:= GetArea()

cQuery := " SELECT F2_DOC,F2_SERIE,F2_EMISSAO,F2_VALFAT AS TOTAL FROM "
cQuery += RetSqlName('SF2') + " F2 "
cQuery += " WHERE F2.D_E_L_E_T_ <> '*' AND "
cQuery += " F2_FILIAL = '"+xFilial("SF2")+"' AND "
cQuery += " SUBSTRING(F2_EMISSAO,1,6) = '" + Iif((nMes-2 == -1 .and. nMes == 1) .or. (nMes-2 == 0 .and. nMes == 2) ,StrZero(Year(MV_PAR02)-1,4),SUBSTR(DTOS(MV_PAR02),1,4)) + StrZero(nMes,2) + "' AND "
cQuery += " F2_TIPO = 'N' AND "
cQuery += " F2.F2_DOC+F2.F2_SERIE+F2.F2_EMISSAO IN (SELECT D2.D2_DOC+D2.D2_SERIE+D2.D2_EMISSAO FROM "
cQuery +=   RetSqlName('SD2')  + " D2 WHERE "
cQuery += " D2.D_E_L_E_T_ <> '*' AND "
cQuery += " D2_FILIAL = '"+xFilial("SD2")+"' AND "
cQuery += " SUBSTRING(D2_EMISSAO,1,6) = '" + Iif((nMes-2 == -1 .and. nMes == 1) .or. (nMes-2 == 0 .and. nMes == 2) ,StrZero(Year(MV_PAR02)-1,4),SUBSTR(DTOS(MV_PAR02),1,4)) + StrZero(nMes,2) + "' AND "
cQuery += " D2_TIPO = 'N' AND "
cQuery += " D2_LOCAL IN ('03','04') AND "
cQuery += " D2_FILIAL = '"+xFilial("SD2")+"' AND "
cQuery += " D2_CF IN (" + Alltrim(cCFOPVenda) + ")) AND "
cQuery += " F2_DOC+F2_SERIE NOT IN (SELECT F3_NFISCAL+F3_SERIE FROM "
cQuery +=   RetSqlName('SF3')
cQuery += " WHERE D_E_L_E_T_ <> '*' "
cQuery += " AND F3_CFO IN (" + Alltrim(cCFOPVenda) + ") "
cQuery += " AND SUBSTRING(F3_ENTRADA,1,6) = '" + Iif((nMes-2 == -1 .and. nMes == 1) .or. (nMes-2 == 0 .and. nMes == 2) ,StrZero(Year(MV_PAR02)-1,4),SUBSTR(DTOS(MV_PAR02),1,4)) + StrZero(nMes,2) + "' "
cQuery += " AND F3_FILIAL = '"+xFilial("SF3")+"' )"
cQuery += " ORDER BY F2_DOC,F2_SERIE,F2_EMISSAO ASC"
	
cQuery:=ChangeQuery(cQuery)
	
MsAguarde({|| dbUseArea(.T.,"TOPCONN",TcGenQry(,,cQuery),cAliasSD2,.T.,.T.)},"Aguarde...","Processando Diferenca Faturamento (NF´s que constam apenas no Faturamento)...")

For nSF2 := 1 To len(aStruSF2)
	If aStruSF2[nSF2][2] <> "C" .And. FieldPos(aStruSF2[nSF2][1])<>0
		TcSetField(cAliasSD2,aStruSF2[nSF2][1],aStruSF2[nSF2][2],aStruSF2[nSF2][3],aStruSF2[nSF2][4])
	EndIf
Next nSF2
DbSelectArea(cAliasSD2)
Do While (cAliasSD2)->(!EOF())
	aadd(aFatFTDIF,{(cAliasSD2)->F2_DOC,(cAliasSD2)->F2_SERIE,(cAliasSD2)->TOTAL})
	(cAliasSD2)->(DbSkip())
EndDo
DbSelectArea(cAliasSD2)
dbCloseArea()
RestArea(aArea)

Return(.T.)

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLay2ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function RFinLay2()

Local aArea := GetArea() 
		aL :=	{}
		aL :=	Array(44)
		//>          1         2         3         4         5         6         7         8         9        10        11        12        13        14        15        16        17        18        19        20        21        20        30
		//>012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
		aL[01]	:=		"|                                                                                                                                                                                                      |"
		aL[02]	:=		"|COMERCIAL (continuacao...)                                                                                                                                                                            |"
		aL[03]	:=		"|                                                                                                                                                                                                      |"
		aL[06]	:=		"|Mercado  Interno                                                                                          |Mercado Externo                                                                            |"
		aL[07]	:=		"|                                                                                                                                                                                                      |"
		aL[04]	:=		"|Mes                        :|################|################|################|                          |################|################|################|                                        |"
		aL[05]	:=		"|======================================================================================================================================================================================================|"
		aL[09]	:=		"|                                                                                                                                                                                                      |"
		aL[08]	:=		"|Faturamento Bruto          :|################|################|################|                          |################|################|################|                                        |"
       	aL[11]	:=		"|                                                                                                                                                                                                      |"        
		aL[10]	:=		"|Condicao de Faturamento    :|                                                                                                                                                                         |"
		aL[12]	:=		"|###############             |################|################|################|                          |################|################|################|                                        |"
       	aL[13]	:=		"|======================================================================================================================================================================================================|"
        aL[14]	:=		"|Devolucao de vendas        :|################|################|################|                          |################|################|################|                                        |"
		aL[15]	:=		"|======================================================================================================================================================================================================|"
		aL[16]	:=		"|Faturamento Liq.           :|################|################|################|                          |################|################|################|                                        |"
		aL[17]	:=		"|                                                                                                                                                                                                      |" 
		aL[18]	:=		"|Custo                      :|################|################|################|                          |################|################|################|                                        |"		
		aL[19]	:=		"|                                                                                                                                                                                                      |"
		aL[20]	:=		"|Margem                     :|################|################|################|                          |################|################|################|                                        |"		
		aL[21]	:=		"|======================================================================================================================================================================================================|"
		aL[22]	:=		"|Preco Medio                :|################|################|################|                          |################|################|################|                                        |"		
		aL[23]	:=		"|======================================================================================================================================================================================================|"
		aL[24]	:=		"|Comissao                   :|################|################|################|                                                                                                                      |"		
		aL[25]	:=		"|                                                                                                                                                                                                      |"
		aL[26]	:=		"|% Comissao                 :|################|################|################|                                                                                                                      |"		
		aL[27]	:=		"|======================================================================================================================================================================================================|"
		aL[28]	:=		"|Gastos Gerais Coml.        :|################|################|################|                          |################|################|################|                                        |"		
		aL[29]	:=		"|                                                                                                                                                                                                      |"
		aL[30]	:=		"|Meta Orcamento Coml.       :|################|################|################|                          |################|################|################|                                        |"		
		aL[31]	:=		"|                                                                                                                                                                                                      |"
        aL[32]	:=		"|Realizado Orcamento Coml.  :|################|################|################|                          |################|################|################|                                        |"		
		aL[33]	:=		"|======================================================================================================================================================================================================|"
       	aL[34]	:=		"|                                                                                                                                                                                                      |"
		aL[35]	:=		"|Faturamento Sucata         :|################|################|################|                                                                                                                      |"
   		aL[36]	:=		"|                                                                                                                                                                                                      |"
		aL[42]	:=		"|                                                                                                                                                                                                      |"        
		aL[41]	:=		"|Condicao de Faturamento    :|                                                                                                                                                                         |"
		aL[43]	:=		"|###############             |################|################|################|                                                                                                                      |"
        aL[44]	:=		"|======================================================================================================================================================================================================|"
		aL[37]	:=		"|Custo Sucata               :|################|################|################|                                                                                                                      |"
   		aL[38]	:=		"|                                                                                                                                                                                                      |"
		aL[39]	:=		"|Margem Sucata              :|################|################|################|                                                                                                                      |"
    	aL[40]	:=		"|======================================================================================================================================================================================================|"

RestArea(aArea)
Return(.T.)


/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLay3ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function RFinLay3()

Local aArea := GetArea() 
		aL :=	{}
		aL :=	Array(59)
				      //>          1         2         3         4         5         6         7         8         9        10        11        12        13        14        15        16        17        18        19        20        21        20        30
					  //>012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
		aL[01]	:=		"|INDUSTRIA                                                                                                                                                                                             |"
		aL[02]	:=		"|                                                                                                                                                                                                      |"
		aL[03]	:=		"|Mercado  Interno                                                                                                        |Mercado Externo                                                              |"
		aL[06]	:=		"|                                                                                                                                                                                                      |"
    	aL[04]	:=		"|Mes                        :|################|################|################|                                        |################|################|################|                          |"
		aL[05]	:=		"|======================================================================================================================================================================================================|"
		aL[07]	:=		"|                                                                                                                                                                                                      |"
		aL[08]	:=		"|Qtd. Cts. Vendidas         :|################|################|################|                                        |################|################|################|                          |"
		aL[09]	:=		"|                                                                                                                                                                                                      |"
   		aL[11]	:=		"|======================================================================================================================================================================================================|"
    	aL[10]	:=		"|Qtd. Cts. Produzidas       :|################|################|################|                                                                                                                      |" 
    	aL[13]	:=		"|                                                                                                                                                                                                      |"
	    aL[12]	:=		"|Maquina                     |Producao                                                                                                                                                                 |" 
		aL[14]	:=		"|########################### |################|################|################|                                                                                                                      |"
	    aL[15]	:=		"|======================================================================================================================================================================================================|" 
        aL[16]	:=		"|Maquina                     |Parada                                                                                                                                                                   |"
	    aL[17]	:=		"|                                                                                                                                                                                                      |" 
		aL[18]	:=		"|########################### |################|################|################|                                                                                                                      |"
	    aL[19]	:=		"|======================================================================================================================================================================================================|" 
        aL[20]	:=		"|Maquina                     |Perda                                                                                                                                                                    |"
		aL[21]	:=		"|                                                                                                                                                                                                      |" 
		aL[22]	:=		"|########################### |################|################|################|                                                                                                                      |"
		aL[23]	:=		"|======================================================================================================================================================================================================|"
        aL[24]	:=		"|Qtd. Estq. Materia Prima   :|################|################|################|                                                                                                                      |"
		aL[25]	:=		"|                                                                                                                                                                                                      |"
        aL[26]	:=		"|Vl.  Estq. Materia Prima   :|################|################|################|                                                                                                                      |"
		aL[27]	:=		"|======================================================================================================================================================================================================|"
        aL[28]	:=		"|Qtd. Estq. Prod. Acabado   :|################|################|################|                                        |################|################|################|                          |"
		aL[29]	:=		"|                                                                                                                                                                                                      |"
        aL[30]	:=		"|Vl.  Estq. Prod. Acabado   :|################|################|################|                                        |################|################|################|                          |"
        aL[31]	:=		"|======================================================================================================================================================================================================|"
   		aL[32]	:=		"|Produtividade Cts/Hora     :|################|################|################|                                        |################|################|################|                          |"
		aL[33]	:=		"|======================================================================================================================================================================================================|"
		aL[40]	:=		"|Materia Prima Nacional     :|################|################|################|                                        |################|################|################|                          |"		
		aL[41]	:=		"|                                                                                                                                                                                                      |"
		aL[42]	:=		"|Materia Prima Importada    :|################|################|################|                                        |################|################|################|                          |"		
		aL[43]	:=		"|                                                                                                                                                                                                      |"
		aL[44]	:=		"|Tributos de Importacao     :|################|################|################|                                        |################|################|################|                          |"		
		aL[45]	:=		"|                                                                                                                                                                                                      |"
		aL[46]	:=		"|Despesas de Importacao     :|################|################|################|                                        |################|################|################|                          |"		
		aL[47]	:=		"|                                                                                                                                                                                                      |"
		aL[48]	:=		"|Frete de Importacao        :|################|################|################|                                        |################|################|################|                          |"		
		aL[49]	:=		"|                                                                                                                                                                                                      |"
		aL[50]	:=		"|Insumos                    :|################|################|################|                                        |################|################|################|                          |"		
		aL[51]	:=		"|                             __________________________________________________                                          __________________________________________________                           |"
		aL[52]	:=		"|TOTAL                      :|################|################|################|                                        |################|################|################|                          |"		
		aL[53]	:=		"|======================================================================================================================================================================================================|"
		aL[54]	:=		"|Mao de Obra                :|################|################|################|                                        |################|################|################|                          |"		
		aL[55]	:=		"|                                                                                                                                                                                                      |"
		aL[56]	:=		"|Energia                    :|################|################|################|                                        |################|################|################|                          |"		
		aL[57]	:=		"|                                                                                                                                                                                                      |"
		aL[58]	:=		"|Agua                       :|################|################|################|                                        |################|################|################|                          |"		
		aL[59]	:=		"|======================================================================================================================================================================================================|"
		aL[34]	:=		"|Gastos Gerais Ind.         :|################|################|################|                                        |################|################|################|                          |"		
		aL[35]	:=		"|                                                                                                                                                                                                      |"
		aL[36]	:=		"|Meta Orcamento Ind.        :|################|################|################|                                        |################|################|################|                          |"		
		aL[37]	:=		"|                                                                                                                                                                                                      |"
		aL[38]	:=		"|Realizado Orcamento Ind.   :|################|################|################|                                        |################|################|################|                          |"		
		aL[39]	:=		"|======================================================================================================================================================================================================|"
RestArea(aArea)
Return(.T.)
		

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLay4ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function RFinLay4()

Local aArea := GetArea() 
		aL :=	{}
		aL :=	Array(102)
		              //>          1         2         3         4         5         6         7         8         9        10        11        12        13        14        15        16        17        18        19        20        21        20        30
			          //>012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
		aL[01]	:=		"|                                                                                                                                                                                                      |"
		aL[02]	:=		"|ADMINISTRATIVO - FINANCEIRO                                                                                                                                                                           |"
		aL[03]	:=		"|                                                                                                                                                                                                      |"
	   	aL[07]	:=		"|Mercado Interno                                                                                                                                                                                       |"
	   	aL[06]	:=		"|                                                                                                                                                                                                      |"
		aL[04]	:=		"|Mes                        :|################|################|################|                                                                                                                      |"
		aL[05]	:=		"|======================================================================================================================================================================================================|"
		aL[08]	:=		"|Pedidos Trava (Mes)        :|################|################|################|                                                                                                                      |"
		aL[09]	:=		"|                                                                                                                                                                                                      |"
		aL[10]	:=		"|Pedidos Trava (Anteriores) :|################|################|################|                                                                                                                      |"
		aL[11]	:=		"|======================================================================================================================================================================================================|"
		aL[12]	:=		"|Tit. na Trava (Mes)        :|################|################|################|                                                                                                                      |"
		aL[13]	:=		"|                                                                                                                                                                                                      |"
		aL[14]	:=		"|Tit. na Trava (Anteriores) :|################|################|################|                                                                                                                      |"
		aL[15]	:=		"|======================================================================================================================================================================================================|"
   		aL[16]	:=		"|Pagamentos por Baixa       :|                                                                                                                                                                         |"        
		aL[17]	:=		"|                                                                                                                                                                                                      |"
		aL[18]	:=		"|###############             |################|################|################|                                                                                                                      |"
       	aL[19]	:=		"|======================================================================================================================================================================================================|"
	   	aL[20]	:=		"|Titulos a Receber (Mes)    :|################|################|################|                                                                                                                      |"
		aL[21]	:=		"|                                                                                                                                                                                                      |"
		aL[55]	:=		"|                                                                                                                                                                                                      |"
		aL[56]	:=		"|Fluxo de Caixa                                                                                                                                                                                        |"		
		aL[57]	:=		"|                                                                                                                                                                                                      |"
	   	aL[22]	:=		"|01 a 30 dias               :|################|################|################|                                                                                                                      |"
		aL[23]	:=		"|                                                                                                                                                                                                      |"
	   	aL[24]	:=		"|31 a 60 dias               :|################|################|################|                                                                                                                      |"
		aL[25]	:=		"|                                                                                                                                                                                                      |"
	   	aL[26]	:=		"|61 a 90 dias               :|################|################|################|                                                                                                                      |"
		aL[27]	:=		"|                                                                                                                                                                                                      |"
	   	aL[28]	:=		"|acima de 90 dias           :|################|################|################|                                                                                                                      |"
		aL[29]	:=		"|======================================================================================================================================================================================================|"
		aL[30]	:=		"|Titulos Liquidados (Mes)   :|################|################|################|                                                                                                                      |"
		aL[31]	:=		"|                                                                                                                                                                                                      |"
       	aL[32]	:=		"|Baixados por               :|                                                                                                                                                                         |"        
		aL[33]	:=		"|                                                                                                                                                                                                      |"
		aL[34]	:=		"|###############             |################|################|################|                                                                                                                      |"
        aL[35]	:=		"|======================================================================================================================================================================================================|"
	   	aL[36]	:=		"|Titulos Vencidos  (Mes)    :|################|################|################|                                                                                                                      |"
		aL[37]	:=		"|                                                                                                                                                                                                      |"
	 	aL[38]	:=		"|% Inadimplencia (Mes)      :|################|################|################|                                                                                                                      |"
		aL[39]	:=		"|======================================================================================================================================================================================================|"
	 	aL[40]	:=		"|Titulos Vencidos 2006      :|################|################|################|                                                                                                                      |"
		aL[41]	:=		"|                                                                                                                                                                                                      |"
		aL[42]	:=		"|Titulos Vencidos 2005      :|################|################|################|                                                                                                                      |"
		aL[43]	:=		"|                                                                                                                                                                                                      |"
		aL[44]	:=		"|Titulos Vencidos 2004      :|################|################|################|                                                                                                                      |"
		aL[45]	:=		"|                                                                                                                                                                                                      |"
		aL[46]	:=		"|Titulos Vencidos 2003      :|################|################|################|                                                                                                                      |"
		aL[47]	:=		"|                                                                                                                                                                                                      |"
		aL[48]	:=		"|Titulos Vencidos  (Anter.) :|################|                                                                                                                                                        |"
		aL[49]	:=		"|======================================================================================================================================================================================================|"
	   	aL[50]	:=		"|Gastos Gerais Adm.         :|################|################|################|                                                                                                                      |"		
		aL[51]	:=		"|                                                                                                                                                                                                      |"
		aL[52]	:=		"|Meta Orcamento Adm.        :|################|################|################|                                                                                                                      |"		
		aL[53]	:=		"|                                                                                                                                                                                                      |"
		aL[54]	:=		"|Realizado Orcamento Adm.   :|################|################|################|                                                                                                                      |"		
        aL[58]	:=		"|======================================================================================================================================================================================================|"
		aL[59]	:=		"|INVESTIMENTOS              :|                                                                                                                                                                         |"		
		aL[60]	:=		"|                                                                                                                                                                                                      |"
		aL[61]	:=		"|Comafal - RS               :|################|################|################|                                        |################|################|################|                          |"		
		aL[62]	:=		"|                                                                                                                                                                                                      |"
		aL[63]	:=		"|Cabomar                    :|################|################|################|                                        |################|################|################|                          |"		
		aL[64]	:=		"|                                                                                                                                                                                                      |"
		aL[65]	:=		"|Maquinas                   :|################|################|################|                                        |################|################|################|                          |"		
		aL[66]	:=		"|                                                                                                                                                                                                      |"
		aL[67]	:=		"|Finame                     :|################|################|################|                                        |################|################|################|                          |"		
		aL[68]	:=		"|                                                                                                                                                                                                      |"
		aL[69]	:=		"|Leasing                    :|################|################|################|                                        |################|################|################|                          |"		
		aL[70]	:=		"|                                                                                                                                                                                                      |"
		aL[71]	:=		"|Benfeitorias               :|################|################|################|                                        |################|################|################|                          |"		
		aL[72]	:=		"|                                                                                                                                                                                                      |"
		aL[73]	:=		"|ISO 9001 - 2000            :|################|################|################|                                        |################|################|################|                          |"		
		aL[74]	:=		"|                                                                                                                                                                                                      |"
		aL[75]	:=		"|TOTAL                      :|################|################|################|                                        |################|################|################|                          |"		
		aL[76]	:=		"|======================================================================================================================================================================================================|"
		aL[77]	:=		"|IMOBILIZADO                :|                                                                                                                                                                         |"		
		aL[78]	:=		"|                                                                                                                                                                                                      |"
		aL[79]	:=		"|Maquinas - Motores         :|################|################|################|                                        |################|################|################|                          |"		
		aL[80]	:=		"|                                                                                                                                                                                                      |"
		aL[81]	:=		"|Importado                  :|################|################|################|                                        |################|################|################|                          |"		
		aL[82]	:=		"|                                                                                                                                                                                                      |"
		aL[83]	:=		"|Informatica                :|################|################|################|                                        |################|################|################|                          |"		
		aL[84]	:=		"|                                                                                                                                                                                                      |"
		aL[85]	:=		"|Moveis e Utensilios        :|################|################|################|                                        |################|################|################|                          |"		
		aL[86]	:=		"|======================================================================================================================================================================================================|"
		aL[87]	:=		"|IMPOSTOS                   :|                                                                                                                                                                         |"		
		aL[88]	:=		"|                                                                                                                                                                                                      |"
		aL[89]	:=		"|INSS                       :|################|################|################|                                        |################|################|################|                          |"		
		aL[90]	:=		"|                                                                                                                                                                                                      |"
		aL[91]	:=		"|FGTS                       :|################|################|################|                                        |################|################|################|                          |"		
		aL[92]	:=		"|                                                                                                                                                                                                      |"
		aL[93]	:=		"|CPMF                       :|################|################|################|                                        |################|################|################|                          |"		
		aL[94]	:=		"|                                                                                                                                                                                                      |"
		aL[95]	:=		"|IPTU                       :|################|################|################|                                        |################|################|################|                          |"		
		aL[96]	:=		"|                                                                                                                                                                                                      |"
		aL[97]	:=		"|IPI                        :|################|################|################|                                        |################|################|################|                          |"		
		aL[98]	:=		"|                                                                                                                                                                                                      |"
		aL[99]	:=		"|ICMS                       :|################|################|################|                                        |################|################|################|                          |"		
		aL[100]	:=		"|======================================================================================================================================================================================================|"
		aL[101]	:=		"|EMPRESTIMOS ENTRE EMPRESAS :|################|################|################|                                                                                                                      |"
		aL[102]	:=		"|======================================================================================================================================================================================================|"
RestArea(aArea)
Return(.T.)
		
/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLay5ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function RFinLay5()

Local aArea := GetArea() 
		aL :=	{}
		aL :=	Array(33)
		              //>          1         2         3         4         5         6         7         8         9        10        11        12        13        14        15        16        17        18        19        20        21        20        30
			          //>012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
		aL[01]	:=		"|                                                                                                                                                                                                      |"
		aL[02]	:=		"|LOGISTICA                                                                                                                                                                                             |"
		aL[03]	:=		"|                                                                                                                                                                                                      |"
		aL[06]	:=		"|Mercado  Interno                                                                                                        |Mercado  Externo                                                             |"
		aL[07]	:=		"|                                                                                                                                                                                                      |"
		aL[04]	:=		"|Mes                        :|################|################|################|                                        |################|################|################|                          |"
		aL[05]	:=		"|======================================================================================================================================================================================================|"
		aL[08]	:=		"|Faturamento Vendas FOB     :|################|################|################|                                        |################|################|################|                          |"
        aL[09]	:=		"|======================================================================================================================================================================================================|"
		aL[10]	:=		"|Faturamento Vendas CIF     :|################|################|################|                                        |################|################|################|                          |"
		aL[11]	:=		"|                                                                                                                                                                                                      |"
		aL[12]	:=		"|Frete Vendas CIF           :|################|################|################|                                        |################|################|################|                          |"
		aL[13]	:=		"|                                                                                                                                                                                                      |"
		aL[14]	:=		"|% Frete Vendas CIF         :|################|################|################|                                        |################|################|################|                          |"
		aL[15]	:=		"|======================================================================================================================================================================================================|"
		aL[16]	:=		"|Faturamento s/ def. frete  :|################|################|################|                                        |################|################|################|                          |"
		aL[17]	:=		"|======================================================================================================================================================================================================|"
		aL[18]	:=		"|Outros Fretes                                                                                                                                                                                         |"
       	aL[19]	:=		"|                                                                                                                                                                                                      |"
		aL[20]	:=		"|Frete Importacao (600201)  :|################|################|################|                                                                                                                      |"
        aL[21]	:=		"|                                                                                                                                                                                                      |"
		aL[22]	:=		"|Frete Exportacao (600401)  :|################|################|################|                                                                                                                      |"
		aL[23]	:=		"|                                                                                                                                                                                                      |"
		aL[24]	:=		"|Frete Benefic.   (600601)  :|################|################|################|                                                                                                                      |"
		aL[25]	:=		"|                                                                                                                                                                                                      |"
		aL[26]	:=		"|Frete Transf.    (600501)  :|################|################|################|                                                                                                                      |"
		aL[27]	:=		"|                                                                                                                                                                                                      |"
		aL[28]	:=		"|Frete Compras COM(600303)  :|################|################|################|                                                                                                                      |"
		aL[29]	:=		"|                                                                                                                                                                                                      |"
		aL[30]	:=		"|Frete Compras IND(600301)  :|################|################|################|                                                                                                                      |"
		aL[31]	:=		"|                                                                                                                                                                                                      |"
		aL[32]	:=		"|Frete Compras ADM(600302)  :|################|################|################|                                                                                                                      |"
		aL[33]	:=		"|======================================================================================================================================================================================================|"


RestArea(aArea)
Return(.T.)

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLay6ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function RFinLay6()

Local aArea := GetArea() 
		aL :=	{}
		aL :=	Array(47)
		              //>          1         2         3         4         5         6         7         8         9        10        11        12        13        14        15        16        17        18        19        20        21        20        30
			          //>012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
		aL[39]	:=		"|                                                                                                                                                                                                      |"
		aL[02]	:=		"|Notas de Saida do Tipo(Devolucao, Beneficiamento, Comp. de Preco, Comp. de Impostos e outros                                                                                                          |"
		aL[01]	:=		"|                                                                                                                                                                                                      |"
		aL[42]	:=		"|                                                                                                                                                                                                      |"
		aL[04]	:=		"|CFOP |Descricao                                                     |Valor R$                                                                                                                         |"
		aL[06]	:=		"|#### |###########################################################   |#####################|                                                                                                           |"
        aL[03]	:=		"|                                                                                                                                                                                                      |"
		aL[05]	:=		"|                                                                                                                                                                                                      |"
		aL[16]	:=		"|Diferenca Faturamento (Nf´s que  constam apenas no faturamento)                                                                                                                                       |" 
		aL[17]	:=		"|Nota Fiscal | Serie |                                               | Valor                                                                                                                           |"
		aL[18]	:=		"| ######     |   ### |                                               |###############|                                                                                                                 |"		
		aL[07]	:=		"|                                                                                                                                                                                                      |"
		aL[15]	:=		"|                                                                                                                                                                                                      |"		
		aL[08]	:=		"|Total do Faturamento                                                |#####################|                                                                                                           |"
		aL[09]	:=		"|======================================================================================================================================================================================================|"
		aL[40]	:=		"|                                                                                                                                                                                                      |"
		aL[12]	:=		"|Divergências Fiscal x Faturamento                                                                                                                                                                     |"
		aL[13]	:=		"|Nota Fiscal | Serie | Observacao                                    | Valor                                                                                                                           |"		
		aL[14]	:=		"| ######     |   ### | ##############################################|###############|                                                                                                                 |"
		aL[11]	:=		"|                                                                                                                                                                                                      |"
		aL[41]	:=		"|                                                                                                                                                                                                      |"
		aL[10]	:=		"|Total no Livro Fiscal                                               |#####################|                                                                                                           |"
		aL[19]	:=		"|======================================================================================================================================================================================================|"
		aL[20]	:=		"|                                                                                                                                                                                                      |"
		aL[21]	:=		"|Notas de Entrada do Tipo(Compras,Devolucao, Beneficiamento, Comp. de Preco, Comp. de Impostos e outros                                                                                                |"
       	aL[22]	:=		"|                                                                                                                                                                                                      |"
		aL[43]	:=		"|                                                                                                                                                                                                      |"
		aL[23]	:=		"|CFOP |Descricao                                                     |Valor R$                                                                                                                         |"
       	aL[24]	:=		"|=====|================================================================================================================================================================================================|"
		aL[25]	:=		"|#### |###########################################################   |################|														|"
		aL[44]	:=		"|                                                                                                                                                                                                      |"
		aL[45]	:=		"|                                                                                                                                                                                                      |"
		aL[35]	:=		"|Diferenca Compras (Nf´s que  constam apenas no Compras)                                                                                                                                               |"
		aL[36]	:=		"|Nota Fiscal | Serie |                                               | Valor                                                                                                                           |"		
		aL[37]	:=		"| ######     |   ### |                                               |###############|                                                                                                                 |"
		aL[38]	:=		"|                                                                                                                                                                                                      |"		
		aL[26]	:=		"|                                                                                                                                                                                                      |"
		aL[27]	:=		"|Compras                 : R$                                        |################|														|"
		aL[28]	:=		"|======================================================================================================================================================================================================|"
		aL[46]	:=		"|                                                                                                                                                                                                      |"
		aL[31]	:=		"|Diferenca Fiscal (Nf´s que constam apenas no Livro Fiscal)                                                                                                                                            |"
		aL[32]	:=		"|Nota Fiscal | Serie | Observacao                                    | Valor                                                                                                                           |"		
		aL[33]	:=		"| ######     |   ### | ##############################################|###############|                                                                                                                 |"
		aL[30]	:=		"|                                                                                                                                                                                                      |"
		aL[47]	:=		"|                                                                                                                                                                                                      |"
		aL[29]	:=		"|Compras no Livro Fiscal : R$                                        |################|														|"
		aL[34]	:=		"|======================================================================================================================================================================================================|"		
		
RestArea(aArea)
Return(.T.)

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLay5ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/

User Function FatOutros(aFatOutros,nMes)             

Local cALiasSD2 := "cALiasSD2"
Local nSD2		:= 0
Local aStruSD2  := SD2->(dbStruct())
Local cQuery 	:= ""	
Local aArea		:= GetArea()

cQuery := " SELECT D2.D2_EMISSAO,D2.D2_DOC,D2.D2_SERIE,D2.D2_COD,D2.D2_UM,D2.D2_QUANT,D2.D2_LOCAL, " 
cQuery += " (D2_TOTAL+D2_VALIPI+D2_ICMSRET+D2_VALFRE+D2_SEGURO+D2_DESPESA) AS TOTAL "
cQuery += " FROM "
cQuery +=   RetSqlName('SD2') + " D2 "
cQuery += " WHERE "
cQuery += " D2.D2_FILIAL = '"+xFilial("SD2")+"' AND "
cQuery += " SUBSTRING(D2_EMISSAO,1,6) = '" + Iif((nMes-2 == -1 .and. nMes == 1) .or. (nMes-2 == 0 .and. nMes == 2) ,StrZero(Year(MV_PAR02)-1,4),SUBSTR(DTOS(MV_PAR02),1,4)) + StrZero(nMes,2) + "' AND "
cQuery += " D2.D2_TIPO = 'N' AND "
cQuery += " D2.D2_LOCAL NOT IN ('03','04') AND "
cQuery += " D2.D2_FILIAL = '"+xFilial("SD2")+"' AND "
cQuery += " D2.D2_CF IN (" + Alltrim(cCFOPVenda) + ") AND "
cQuery += " D2.D_E_L_E_T_ = ' ' "
cQuery += " ORDER BY D2.D2_EMISSAO,D2.D2_DOC,D2.D2_SERIE,D2.D2_COD,D2.D2_UM,D2.D2_QUANT,D2.D2_LOCAL ASC"
	
cQuery:=ChangeQuery(cQuery)
	
MsAguarde({|| dbUseArea(.T.,"TOPCONN",TcGenQry(,,cQuery),cAliasSD2,.T.,.T.)},"Aguarde...","Processando Outros Faturamentos Fora do Armazem 01...")

For nSD2 := 1 To len(aStruSD2)
	If aStruSD2[nSD2][2] <> "C" .And. FieldPos(aStruSD2[nSD2][1])<>0
		TcSetField(cAliasSD2,aStruSD2[nSD2][1],aStruSD2[nSD2][2],aStruSD2[nSD2][3],aStruSD2[nSD2][4])
	EndIf
Next nSD2
	
DbSelectArea(cAliasSD2)
	
Do While (cAliasSD2)->(!EOF())
	aadd(aFatOutros,{Alltrim((cAliasSD2)->D2_DOC),;
					 Alltrim((cAliasSD2)->D2_SERIE),;
					 Alltrim((cAliasSD2)->D2_COD),;
					 Substr(Alltrim(Posicione("SB1",1,xFilial("SB1")+(cAliasSD2)->D2_COD,"B1_DESC")),1,20),;
					  (cAliasSD2)->D2_QUANT,;
					  (cAliasSD2)->D2_LOCAL,;
					  (cAliasSD2)->TOTAL})
	(cAliasSD2)->(DbSkip())
EndDo
	
DbSelectArea(cAliasSD2)
dbCloseArea()

RestArea(aArea)

Return(.T.)

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLayoutºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function RFinLayOut()

Local aArea := GetArea()
		aL :=	Array(39)
		//>          1         2         3         4         5         6         7         8         9        10        11        12        13        14        15        16        17        18        19        20        21        20        30
		//>012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
		aL[01]	:=		"|==============================================================================================================================================================  ======================================|"
		aL[02]	:=		"|Dia          |QTD |Pedidos Bruto   |Pedidos Desconto|Pedidos Liquido| Faturados Bruto|   Devolucoes  | Bonificacoes |  Faturados Liq.| Acumulado Bruto | Acumulado Liq.  |     Custo     |Margem Liq.%|"
		aL[03]	:=	    "|             |    |     (A)        |      (B)       |      (A-B)    |        (C)     |       (D)     |      (E)     |    (C)-(D+E)   |     Soma(C)     | Soma((C)-(D+E)) |               |-Dia- -Acum-|"
		aL[04]	:=		"|_____________|____|________________|________________|_______________|________________|_______________|______________|________________|_________________|_________________|_______________|____________|"
		aL[05]	:=		"|############ |### |################|################|###############|################| ############# | ############ |################|#################|#################|###############|##### ##### |"
		aL[06]	:=		"|______________________________________________________________________________________________________________________________________________________________________________________________________|"
		aL[07]	:=		"|Total        |####|################|################|###############|################| ############# | ############ |################|#################|#################|###############|            |"
		aL[08]	:=		"|                                                                                                                                                                                                      |"
		aL[31]	:=		"|                                                                                                                                                                                                      |"
		aL[15]	:=		"|DIFERENCA FATURAMENTO (NF´s que constam apenas no Faturamento)                                                                                                                                        |"
		aL[16]	:=		"|Nota Fiscal | Serie | Observacao                                    | Valor          |                                                                                                                |"		
		aL[17]	:=		"| ######     |   ### | ##############################################|################|                                                                                                                |"
		aL[18]	:=		"|======================================================================================================================================================================================================|"		
		aL[32]	:=		"|                                                                                                                                                                                                      |"
		aL[11]	:=		"|DIFERENCA FISCAL (NF´s que constam apenas no Livro Fiscal)                                                                                                                                            |"
		aL[12]	:=		"|Nota Fiscal | Serie | Observacao                                    | Valor          |                                                                                                                |"		
		aL[13]	:=		"| ######     |   ### | ##############################################|################|                                                                                                                |"
		aL[33]	:=		"|                                                                                                                                                                                                      |"
		aL[34]	:=		"|                                                                                                                                                                                                      |"
		aL[09]	:=		"|FATURAMENTO DE VENDAS NO LIVRO FISCAL : R$                          |################|                                                                                                                |"
		aL[10]	:=		"|======================================================================================================================================================================================================|"
		aL[14]	:=		"|                                                                                                                                                                                                      |"		
		aL[19]	:=		"|OUTROS FATURAMENTOS FORA DO ARMAZEM 03 e 04                                                                                                                                                           |"
		aL[20]	:=		"|Nota Fiscal | Serie | Produto       | Descricao                                         | QTD           | Armazem | Valor           |                                                                 |"		
		aL[21]	:=		"| ######     |   ### | ##############| ################################################# |###############|   ##    | ############### |                                                                 |"
		aL[35]	:=		"|                                                                                                                                                                                                      |"
		aL[22]	:=		"|======================================================================================================================================================================================================|"		
		aL[36]	:=		"|                                                                                                                                                                                                      |"
		aL[23]	:=		"|FATURAMENTOS QUE NAO GERARAM FINANCEIRO                                                                                                                                                               |"
		aL[24]	:=		"|Cliente| Loja | Nome                                   |Nota Fiscal | Serie | Produto       | Descricao                                         | QTD           | Armazem | Valor                     |"		
		aL[25]	:=		"|###### | ##   | ###################################### | ######     |   ### | ##############| ################################################# |###############|   ##    | ###############           |"
		aL[26]	:=		"|                                                                                                                                                                                                      |"		
		aL[37]	:=		"|======================================================================================================================================================================================================|"		
		aL[38]	:=		"|                                                                                                                                                                                                      |"		
		aL[27]	:=		"|FATURAMENTOS QUE NAO DERAM BAIXA NO ESTOQUE                                                                                                                                                           |"
		aL[28]	:=		"|Cliente| Loja | Nome                                   |Nota Fiscal | Serie | Produto       | Descricao                                         | QTD           | Armazem | Valor                     |"		
		aL[29]	:=		"|###### | ##   | ###################################### | ######     |   ### | ##############| ################################################# |###############|   ##    | ###############           |"
		aL[39]	:=		"|                                                                                                                                                                                                      |"		
		aL[30]	:=		"|======================================================================================================================================================================================================|"		
	
RestArea(aArea)
Return(.T.)



/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLay2ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function RFinLay9()

Local aArea := GetArea() 
		aL :=	{}
		aL :=	Array(33)
		//>          1         2         3         4         5         6         7         8         9        10        11        12        13        14        15        16        17        18        19        20        21        20        30
		//>012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
		aL[01]	:=		"|                                                                                                                                                                                                      |"
		aL[02]	:=		"|COMERCIAL                                                                                                                                                                                             |"
		aL[03]	:=		"|                                                                                                                                                                                                      |"
		aL[04]	:=		"|Mes                              :|################|################|################|                                                                                                                |"
		aL[05]	:=		"|======================================================================================================================================================================================================|"
		aL[06]	:=		"|Qtd. de Clientes Novos(mes)      :|################|################|################|                                                                                                                |"
		aL[07]	:=		"|                                                                                                                                                                                                      |"
       	aL[08]	:=		"|Qtd. de Clientes Ativos          :|################|################|################|                                                                                                                |"
		aL[09]	:=		"|                                                                                                                                                                                                      |"
       	aL[10]	:=		"|Qtd. de Clientes Inativos        :|################|################|################|                                                                                                                |"
       	aL[11]	:=		"|======================================================================================================================================================================================================|"
  	   	aL[12]	:=		"|                                                                                                                                                                                                      |"
       	aL[13]	:=		"|Qtd. de Clientes Atendidos(mes)  :|################|################|################|                                                                                                                |"
		aL[14]	:=		"|                                                                                                                                                                                                      |"
       	aL[15]	:=		"|Qtd. de Pedidos Emitidos(mes)    :|################|################|################|                                                                                                                |"
		aL[16]	:=		"|                                                                                                                                                                                                      |" 
       	aL[17]	:=		"|Valor Tot. Ped. Emitidos(mes)    :|################|################|################|                                                                                                                |"
		aL[18]	:=		"|======================================================================================================================================================================================================|"
		aL[19]	:=		"|% Atendimento                    :|################|################|################|                                                                                                                |"		
		aL[20]	:=		"|======================================================================================================================================================================================================|"
		aL[21]	:=		"|                                                                                                                                                                                                      |"		
	    aL[22]	:=		"|Qtd. de Pedidos Faturados (mes)  :|################|################|################|                                                                                                                |"
		aL[23]	:=		"|                                                                                                                                                                                                      |"
      	aL[24]	:=		"|Val. de Pedidos Faturados (mes)  :|################|################|################|                                                                                                                |"
		aL[25]	:=		"|======================================================================================================================================================================================================|"
	    aL[26]	:=		"|Qtd. de Ped. nao Faturados(mes)  :|################|################|################|                                                                                                                |"
		aL[27]	:=		"|                                                                                                                                                                                                      |"
      	aL[28]	:=		"|Val. de Ped. nao Faturados(mes)  :|################|################|################|                                                                                                                |"
		aL[29]	:=		"|======================================================================================================================================================================================================|"
	    aL[30]	:=		"|Val.de Ped. Emit. e Faturad.(mes):|################|################|################|                                                                                                                |"
		aL[31]	:=		"|                                                                                                                                                                                                      |"
	  	aL[32]	:=		"|Val.de Ped. Emit. e nao Fat.(mes):|################|################|################|                                                                                                                |"
		aL[33]	:=		"|======================================================================================================================================================================================================|"

RestArea(aArea)
Return(.T.)

/*
ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
±±ÉÍÍÍÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍËÍÍÍÍÍÍÑÍÍÍÍÍÍÍÍÍÍÍÍÍ»±±
±±ºFunction  ³RFinLay2ºAutor  ³Eduardo Zanardo     º Data ³  19/03/03   º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÊÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºDesc.     ³Layout do relatorio                                         º±±
±±ÌÍÍÍÍÍÍÍÍÍÍØÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¹±±
±±ºUso       ³ RFin003                                                    º±±
±±ÈÍÍÍÍÍÍÍÍÍÍÏÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ¼±±
±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±±
ßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßßß
*/
User Function LayoutDRE()

Local aArea := GetArea() 
		aL :=	{}
		aL :=	Array(53)
		//>          1         2         3         4         5         6         7         8         9        10        11        12        13        14        15        16        17        18        19        20        21        20        30
		//>012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890

		aL[01]	:=		"|                                                                                                 |"
		aL[02]	:=		"|DEMONSTRATIVO DE RESULTADO                   :|################|################|################|"
		aL[03]	:=		"|                                                                                                 |"
		aL[04]	:=		"|FATURAMENTO BRUTO                             |################|################|################|"
		aL[05]	:=		"|  Mercado Interno                             |################|################|################|"
		aL[06]	:=		"|  Mercado Externo                             |################|################|################|"
		aL[07]	:=		"|                                                                                                 |"													
		aL[08]	:=		"|(-)DEDUÇÕES DE VENDAS                         |################|################|################|"
		aL[09]	:=		"|      Impostos                                |################|################|################|"
		aL[10]	:=		"|          ICMS                                |################|################|################|"		
		aL[11]	:=		"|          IPI                                 |################|################|################|"
		aL[12]	:=		"|          PIS+COFINS                          |################|################|################|"
		aL[13]	:=		"|      Devolucoes                              |################|################|################|" 
		aL[14]	:=		"|          Merc. Interno                       |################|################|################|"
		aL[15]	:=		"|          Merc. Externo                       |################|################|################|"
		aL[16]	:=		"|      Outras deduções                         |################|################|################|"
		aL[17]	:=		"|                                                                                                 |" 
		aL[18]	:=		"|RECEITA LIQUIDA DE VENDAS                     |################|################|################|"
		aL[19]	:=		"|                                                                                                 |" 
		aL[20]	:=		"|(-)CUSTO PRODUTO VENDIDOS                     |################|################|################|"
		aL[21]	:=		"|      Custo Diretos                           |################|################|################|"
		aL[22]	:=		"|          Materia Prima                       |################|################|################|"		
		aL[23]	:=		"|          Salarios Producao                   |################|################|################|"
		aL[24]	:=		"|          Beneficiamento                      |################|################|################|" 
		aL[25]	:=		"|          Insumos                             |################|################|################|"
		aL[26]	:=		"|      Custo Indiretos                         |################|################|################|"
		aL[27]	:=		"|          Energia Eletrica                    |################|################|################|"		
		aL[28]	:=		"|          Agua                                |################|################|################|"
		aL[29]	:=		"|          Aluguel                             |################|################|################|" 
		aL[30]	:=		"|          Salarios Adm Industria              |################|################|################|"
		aL[31]	:=		"|                                                                                                 |"																											
		aL[32]	:=		"|LUCRO BRUTO                                   |################|################|################|"
		aL[33]	:=		"|                                                                                                 |"																											
		aL[34]	:=		"|(-)DESPESAS(Receitas) OPERACIONAIS            |################|################|################|"
		aL[35]	:=		"|      Comerciais                              |################|################|################|"
		aL[36]	:=		"|      Administrativas                         |################|################|################|"
		aL[37]	:=		"|      Financeiras                             |################|################|################|"
		aL[38]	:=		"|          Despesas                            |################|################|################|"
		aL[39]	:=		"|          Receitas(-)                         |################|################|################|"
		aL[40]	:=		"|      Outras                                  |################|################|################|"
		aL[41]	:=		"|          Despesas                            |################|################|################|"
		aL[42]	:=		"|          Receitas(-)                         |################|################|################|"
		aL[43]	:=		"|                                                                                                 |"																											
		aL[44]	:=		"|LUCRO OPERACIONAL                             |################|################|################|"
		aL[45]	:=		"|                                                                                                 |"																											
		aL[46]	:=		"|Resultado não Operacional,líquido             |################|################|################|"
		aL[47]	:=		"|                                                                                                 |"																											
		aL[48]	:=		"|LUCRO ANTES DO IR E CS                        |################|################|################|"
		aL[49]	:=		"|                                                                                                 |"																											
		aL[50]	:=		"|(-)IMPOSTO DE RENDA E CONTRIBUIÇÃO SOCIAL     |################|################|################|"
		aL[51]	:=		"|                                                                                                 |"																											
		aL[52]	:=		"|LUCRO LÍQUIDO DO EXERCÍCIO                    |################|################|################|"
		aL[53]	:=		"|_________________________________________________________________________________________________|"
		
RestArea(aArea)
Return(.T.)
